# One Hot Encoding:

One-hot encoding is a data transformation technique used to convert categorical variables into a binary matrix format. It creates binary columns for each unique category in the original feature and represents the presence or absence of a category with a 1 or 0 respectively.

### Example:
For example, consider a categorical feature "Color" with three unique values: Red, Green, and Blue. One-hot encoding will create three new binary columns - "Red", "Green", and "Blue". For each sample, if the color is Red, the "Red" column will have a value of 1 and "Green" and "Blue" will be 0. Similarly, if the color is Green, the "Green" column will be 1, and the others will be 0, and so on for each unique category. This encoding helps in dealing with categorical variables in machine learning algorithms that require numerical inputs.

# NOTE: 
###### In Machine Learning, Whenever we perform One Hot Encoding on 'n' categories  ,we drop one of the generated binary columns (features) and keep only (n-1) features

### Why Keep Only n-1 Features?

###### Redundancy: 
If you have n categories, creating n binary columns captures all the information but introduces redundancy. Let's say we have "Is_Apple" and "Is_Banana" columns. If both of these columns are 0, it automatically implies it's the third category, "Is_Orange". So, having all three columns is redundant.

###### The Problem:
Including all n columns leads to multicollinearity in certain machine learning models, especially linear models like linear regression or logistic regression.

###### Multicollinearity:
Multicollinearity occurs when there is a strong correlation between two or more independent variables. It can make models unstable and difficult to interpret.

###### Solution:
To avoid multicollinearity, we keep only n-1 columns for a categorical feature with n categories. By having n-1 columns, we can represent all the information about the categories without redundancy.

###### How it Works:
For instance, with "Fruit" categories, if "Is_Apple" and "Is_Banana" are both 0, it automatically indicates it's the third category, "Is_Orange". Thus, dropping one column doesn't lose any information and avoids multicollinearity.

#### Note:  
By keeping only n-1 columns in one-hot encoding, we prevent redundancy and multicollinearity in our data, helping machine learning models perform better and improving their interpretability.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('cars.csv')

In [3]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [20]:
df['brand'].value_counts()

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: brand, dtype: int64

In [21]:
df['brand'].nunique()

32

In [22]:
df['fuel'].value_counts()

Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: fuel, dtype: int64

In [23]:
df['owner'].value_counts()

First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: owner, dtype: int64

## 1. OneHotEncoding using Pandas

In [5]:
pd.get_dummies(df,columns=['fuel','owner'])

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,0,1,1,0,0,0,0
8124,Hyundai,119000,135000,0,1,0,0,0,1,0,0,0
8125,Maruti,120000,382000,0,1,0,0,1,0,0,0,0
8126,Tata,25000,290000,0,1,0,0,1,0,0,0,0
8127,Tata,25000,290000,0,1,0,0,1,0,0,0,0

## 2. K-1 OneHotEncoding

In [6]:
pd.get_dummies(df,columns=['fuel','owner'],drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,1,0,0,0,0,0,0
1,Skoda,120000,370000,1,0,0,0,1,0,0
2,Honda,140000,158000,0,0,1,0,0,0,1
3,Hyundai,127000,225000,1,0,0,0,0,0,0
4,Maruti,120000,130000,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,1,0,0,0,0
8124,Hyundai,119000,135000,1,0,0,1,0,0,0
8125,Maruti,120000,382000,1,0,0,0,0,0,0
8126,Tata,25000,290000,1,0,0,0,0,0,0
8127,Tata,25000,290000,1,0,0,0,0,0,0

###### get_dummies creates a new Pandas DataFrame with one-hot encoded columns, which isn't directly compatible with Scikit-Learn's pipeline. The Pipeline expects transformers and estimators to implement a fit and transform method. so, its better to do OneHotEncoding using Sklearn

## 3. OneHotEncoding using Sklearn

In [7]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(df.iloc[:,0:4],df.iloc[:,-1],test_size=0.2,random_state=2)

In [8]:
X_train.head()

         brand  km_driven    fuel         owner
5571   Hyundai      35000  Diesel   First Owner
2038      Jeep      60000  Diesel   First Owner
2957   Hyundai      25000  Petrol   First Owner
7618  Mahindra     130000  Diesel  Second Owner
6684   Hyundai     155000  Diesel   First Owner

In [9]:
from sklearn.preprocessing import OneHotEncoder

In [10]:
ohe = OneHotEncoder(drop='first',sparse_output=False,dtype=np.int32)

In [11]:
X_train_new = ohe.fit_transform(X_train[['fuel','owner']])

In [12]:
X_test_new = ohe.transform(X_test[['fuel','owner']])

In [13]:
X_train_new.shape

(6502, 7)

In [14]:
np.hstack((X_train[['brand','km_driven']].values,X_train_new))

array([['Hyundai', 35000, 1, ..., 0, 0, 0],
       ['Jeep', 60000, 1, ..., 0, 0, 0],
       ['Hyundai', 25000, 0, ..., 0, 0, 0],
       ...,
       ['Tata', 15000, 0, ..., 0, 0, 0],
       ['Maruti', 32500, 1, ..., 1, 0, 0],
       ['Isuzu', 121000, 1, ..., 0, 0, 0]], dtype=object)

In [24]:
np.hstack((X_train[['brand','km_driven']].values,X_train_new)).shape

(6502, 9)

## 4. OneHotEncoding with Top Categories

In [25]:
counts = df['brand'].value_counts()
counts

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: brand, dtype: int64

In [16]:
df['brand'].nunique()
threshold = 100

In [26]:
repl = counts[counts <= threshold].index
repl

Index(['Nissan', 'Jaguar', 'Volvo', 'Datsun', 'Mercedes-Benz', 'Fiat', 'Audi',
       'Lexus', 'Jeep', 'Mitsubishi', 'Force', 'Land', 'Isuzu', 'Kia',
       'Ambassador', 'Daewoo', 'MG', 'Ashok', 'Opel', 'Peugeot'],
      dtype='object')

In [27]:
pd.get_dummies(df['brand'].replace(repl, 'uncommon')).sample(5)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,uncommon
2209,0,0,0,0,0,0,1,0,0,0,0,0,0
4053,0,0,0,0,0,0,0,1,0,0,0,0,0
3455,0,0,0,0,0,0,1,0,0,0,0,0,0
7803,0,0,0,0,1,0,0,0,0,0,0,0,0
142,0,0,0,0,0,0,0,0,0,0,0,0,1

In [28]:
pd.get_dummies(df['brand'].replace(repl, 'uncommon')).shape

(8128, 13)